Revit 2027 API
BuiltInFailures.CurveFailures.SelfIntersectingSpline Property
 Self intersecting splines are not allowed in sketches.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SelfIntersectingSpline { get; }
Public Shared ReadOnly Property SelfIntersectingSpline As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SelfIntersectingSpline {
	FailureDefinitionId^ get ();
}
static member SelfIntersectingSpline : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurveFailures Class
Autodesk.Revit.DB Namespace